04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/film/rivuletBox/0/film/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/film";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform  300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }

    wall
    {
        type            coupledTemperature;
        value           $internalField;
    }

    surface
    {
        type            coupledTemperature;
        value           $internalField;
    }
}


// ************************************************************************* //
